emd-mongo-spring-soap-provider/src/test/resources/bikes.xml

<soapenv:Envelope
    xmlns="llc:jaradatbros:emd:api:soap:mongo"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header />
    <soapenv:Body>
        <GetBikeRequest>
            <name>Cannondale</name>
        </GetBikeRequest>
    </soapenv:Body>
</soapenv:Envelope>